## Exploring data: head, tail, info, describe, and value_counts methods

In [8]:
# Import Pandas
import pandas as pd 
import numpy as np

In [2]:
# Read the data from "data.csv"
data_csv=pd.read_csv("data.csv")

In [3]:
# Print the result
print(data_csv)

       Name  Age  Gender           City  Salary
0     Alice   25  Female       New York   60000
1       Bob   30    Male  San Francisco   80000
2   Charlie   22    Male    Los Angeles   55000
3     David   28    Male        Chicago   75000
4       Eve   35  Female         Boston   90000
5     Frank   29    Male        Seattle   72000
6     Grace   31  Female         Austin   85000
7    Hannah   26  Female         Denver   68000
8     Isaac   27    Male          Miami   62000
9     Julia   24  Female       Portland   57000
10    Karen   33  Female        Houston   78000
11     Liam   23    Male         Dallas   60000
12    Megan   29  Female        Phoenix   71000
13     Noah   32    Male        Atlanta   84000
14   Olivia   28  Female        Chicago   78000
15    Peter   25    Male         Boston   65000
16    Quinn   29    Male        Seattle   72000
17   Rachel   27  Female  San Francisco   95000
18      Sam   30    Male    Los Angeles   58000
19   Taylor   26    Male         Denver   71000
20      Uma   24  Female       New York   67000
21    Vince   31    Male          Miami   74000
22    Wendy   34  Female        Houston   89000
23   Xander   28    Male         Dallas   62000
24     Yara   23  Female         Austin   61000
25     Zane   25    Male        Phoenix   66000

In [4]:
# Get the first 5 rows 
data_csv.head(5)

      Name  Age  Gender           City  Salary
0    Alice   25  Female       New York   60000
1      Bob   30    Male  San Francisco   80000
2  Charlie   22    Male    Los Angeles   55000
3    David   28    Male        Chicago   75000
4      Eve   35  Female         Boston   90000

In [5]:
# Get the last 5 rows
data_csv.tail(5)

      Name  Age  Gender     City  Salary
21   Vince   31    Male    Miami   74000
22   Wendy   34  Female  Houston   89000
23  Xander   28    Male   Dallas   62000
24    Yara   23  Female   Austin   61000
25    Zane   25    Male  Phoenix   66000

In [7]:
# Print the summary of the dataframe
data_csv.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 26 entries, 0 to 25
Data columns (total 5 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   Name    26 non-null     object
 1   Age     26 non-null     int64
 2   Gender  26 non-null     object
 3   City    26 non-null     object
 4   Salary  26 non-null     int64
dtypes: int64(2), object(3)
memory usage: 1.1+ KB

In [10]:
# Print the statisctics of the dataframe
data_csv.describe()

             Age        Salary
count  26.000000     26.000000
mean   27.846154  71346.153846
std     3.517866  11027.029728
min    22.000000  55000.000000
25%    25.000000  62000.000000
50%    28.000000  71000.000000
75%    30.000000  78000.000000
max    35.000000  95000.000000

In [14]:
# Print the male and female count
print(data_csv['Gender'].value_counts())

Gender
Male      14
Female    12
Name: count, dtype: int64

In [9]:
# Challenge

# Get max age
max_age= np.max(data_csv.Age)

# Get Average salary
avg_salary=np.average(data_csv.Salary)
print("max age ", max_age ," avg_salary ",avg_salary)

max age  35  avg_salary  71346.15384615384